{
  "Header": {
    "about": "Про нас",
    "translation": "Переклад",
    "context": "Контекст",
    "demoDictionary": "Демо-словник",
    "signIn": "Увійти",
    "signUp": "Зареєструватися"
  },
  "Footer": {
    "about": "Про нас",
    "translation": "Переклад",
    "context": "Контекст",
    "demoDictionary": "Демо-словник",
    "subscribe": "Підписатися",
    "privacyPolicy": "© 2025 Memory Assistant. Всі права захищені."
  },
  "HomePage": {
    "title": "Розкрийте свій мовний потенціал вже сьогодні",
    "subtitle": "Memory Assistant — це ваш незамінний інструмент для легкого освоєння іноземних слів. Завдяки нашим інноваційним функціям ви можете перекладати, створювати персоналізовані словники та перевіряти свої знання, щоб покращити процес навчання.",
    "createAVocabulary": "Створити словник",
    "features": {
      "title": "Легкий переклад тексту та збереження нових слів економить багато часу",
      "addWords": {
        "title": "Додавайте незнайомі слова до персоналізованих словників для ефективного навчання",
        "subtitle": "Наш інтуїтивний інтерфейс робить вивчення мови простим і захопливим"
      },
      "takeTests": {
        "title": "Проходьте тести, щоб закріпити розуміння та запам'ятовування слів",
        "subtitle": "Киньте собі виклик за допомогою різних тестів, адаптованих до вашого темпу навчання"
      },
      "sentenceExamples": {
        "title": "Аналізуйте приклади речень, щоб краще розуміти слова в контексті та їх використання",
        "subtitle": "Контекстне навчання покращує вашу здатність запам’ятовувати та застосовувати нові слова"
      }
    },
    "featureDictionary": {
      "title": "Створіть власний персоналізований словник для легкого вивчення мов",
      "subtitle": "З нашою функцією персоналізованого словника ви зможете легко додавати нові слова, які зустрічаєте. Створюйте власні словники відповідно до вашого стилю навчання та відстежуйте свій прогрес.",
      "list": {
        "advantage1": "Легко додавайте слова, які хочете вивчити.",
        "advantage2": "Створюйте власні словники для цілеспрямованого навчання.",
        "advantage3": "Відстежуйте свій прогрес за допомогою персоналізованих тестів."
      }
    },
    "getInTouch": {
      "title": "Зв'яжіться з нами",
      "subtitle": "Ми тут, щоб допомогти вам з будь-якими запитаннями",
      "email": {
        "title": "Електронна пошта",
        "subtitle": "Зв'яжіться з нами в будь-який час за вказаною електронною адресою.",
        "link": "memoryassistant@gmail.com"
      },
      "liveChat": {
        "title": "Чат у реальному часі",
        "subtitle": "Спілкуйтеся з нашою службою підтримки для миттєвої допомоги в Telegram.",
        "link": "Почати новий чат у Telegram"
      },
      "phone": {
        "title": "Телефон",
        "subtitle": "Зателефонуйте нам для негайної допомоги в будь-який час.",
        "link": "+38 (068) 905-06-93"
      }
    }
  },
  "AboutPage": {
    "title": "Memory Assistant",
    "subtitle": "Memory Assistant — це унікальний інструмент для вивчення іноземних мов, який допомагає не тільки перекладати слова, а й ефективно їх запам’ятовувати. Ми створили платформу, що поєднує в собі перекладач, пошукову систему значень слів, персональний словник і систему тестування, розроблену для довготривалого запам’ятовування лексики.",
    "why": {
      "title": "Чому саме Memory Assistant?",
      "subtitle": "Під час вивчення мови однією з найбільших проблем є запам’ятовування нових слів і те, що вони швидко забуваються. Memory Assistant вирішує цю проблему комплексним підходом:",
      "reason1": {
        "title": "Розширений пошук значень слів",
        "subtitle": "Звичайні словники дають одне або два значення слова, проте багато слів мають десятки перекладів залежно від контексту. Memory Assistant надає всі можливі варіанти перекладу разом із прикладами у реченнях, що допомагає зрозуміти нюанси використання слів."
      },
      "reason2": {
        "title": "Переклад текстів",
        "subtitle": "Наша платформа дозволяє швидко перекладати будь-які тексти, не просто дослівно, а з аналізом змісту, щоб уникнути буквальних помилок. Ви можете перекладати статті, діалоги, інструкції тощо, враховуючи контекст."
      },
      "reason3": {
        "title": "Створення персональних словників",
        "subtitle": "Зберігайте важливі слова в персоналізованих списках. Це особливо корисно, якщо ви навчаєтеся за темами, готуєтесь до іспитів або хочете запам’ятати слова з певного тексту. Ваш словник — це ваша особиста база знань, доступна будь-коли."
      },
      "reason4": {
        "title": "Ефективні тести для покращення пам’яті",
        "subtitle": "Просто перекладати і запам’ятовувати слова недостатньо для опанування мови. Саме тому ми розробили інтерактивну систему тестування, яка допомагає закріпити нову лексику."
      }
    },
    "who": {
      "title": "Для кого створений Memory Assistant?",
      "subtitle": "Під час вивчення мови однією з найбільших проблем є запам’ятовування нових слів і те, що вони швидко забуваються. Memory Assistant вирішує цю проблему комплексним підходом:",
      "forWho": {
        "studentsAndLearners": {
          "who": "Студенти та учні",
          "how": " – готуйтеся до іспитів і розширюйте словниковий запас."
        },
        "travelers": {
          "who": "Мандрівники",
          "how": " – запам’ятовуйте важливі слова та фрази перед поїздкою."
        },
        "professionalsWorking": {
          "who": "Фахівці, які працюють з іноземними мовами",
          "how": " – перекладачі, копірайтери, IT-спеціалісти та інші."
        },
        "anyoneWhoWants": {
          "who": "Усі, хто хоче ефективно вивчати мову",
          "how": " – будь то англійська, російська чи будь-яка інша мова."
        }
      }
    },
    "conclusion": {
      "title": "Висновок",
      "subtitle": "Ми віримо, що вивчення мов має бути зручним, захоплюючим і ефективним. Memory Assistant допоможе вам у цьому! Використовуйте наші інструменти, проходьте тести, створюйте власні словники та зробіть вивчення мов частиною вашого повсякденного життя!"
    }
  },
  "TranslationDialog": {
    "title": "Переклад",
    "from": "Введіть текст для перекладу",
    "to": "Переклад"
  }
}
